Revit 2024 API
FailureMessage.HasResolutions Method
 Checks if the failure has any resolutions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public bool HasResolutions()
Visual Basic
Public Function HasResolutions As Boolean
Visual C++
public:
bool HasResolutions()
Return Value
 True if the failure has any resolutions, false otherwise.
See Also
FailureMessage Class
Autodesk.Revit.DB Namespace